MDFreak/md_tinyhouse_ESP32/src/prj_conf_test_stdlib.h
              //              #define MQTT_VCC50        "vcc50"
              //            #endif
              //        #endif
              //      #if (USE_VCC33_ANA > OFF)
              //          #define VCC33_ADC         OFF
              //          #define VCC33_1115        ON
              //          #if (VCC33_1115 > OFF)
              //              #define VCC33_1115_UNIDX   0
              //              #define VCC33_1115_CHIDX   3    //
              //              #define ADS11_GAIN        GAIN_TWOTHIRDS
              //              #define ADS11_RATE        RATE_ADS1115_128SPS
              //              #define ADS11_MUX         ADS1X15_MUX_SINGLE
              //              #define VCC33_SCAL        OFF
              //              #define VCC33_OFFRAW      0
              //              #define VCC33_GAIN        1
              //              #define VCC33_OFFREAL     0
              //            #endif
              //          #if (USE_MQTT > OFF)
              //              #define MQTT_VCC33          "vcc33"
              //            #endif
              //        #endif
              //      #ifndef USE_INPUT_CYCLE
              //          #define USE_INPUT_CYCLE
              //        #endif
            #endif
          #if (USE_POTI_ANA > OFF)
              //      #define POTI1_FILT              9
              //      #define POTI1_DROP              1
              //      #define POTI1_ADC               OFF
              //      #if (POTI1_ADC > OFF)
              //          #define POTI1_ADC_ATT     ADC_ATTEN_DB_11
              //          #define VCC_SCAL_OFFRAW   0
              //          #define VCC_SCAL_GAIN     1
              //          #define VCC_SCAL_OFFREAL  0
              //        #endif
              //      #define POTI1_1115              ON
              //      #if (POTI1_1115 > OFF)
              //          #define POTI1_1115_UNIDX    0
              //          #define POTI1_1115_CHIDX    0
              //          #define ADS14_GAIN          GAIN_TWOTHIRDS
              //          #define ADS14_RATE          RATE_ADS1115_128SPS
              //          #define ADS14_MUX           ADS1X15_MUX_SINGLE
              //          #define POTI1_OFFRAW        0
              //          #define POTI1_GAIN          1
              //          #define POTI1_OFFREAL       0
              //        #endif
              //      #if (USE_MQTT > OFF)
              //          #define MQTT_POTI1          "poti1"
              //        #endif
              //      #if (USE_POTI_ANA > 1)
              //          #define POTI2_FILT          7
              //          #define POTI2_DROP          0
              //          #define POTI2_SCAL          OFF
              //          #define POTI2_SCAL_MIN      0
              //          #define POTI2_SCAL_MAX      100
              //          #define POTI2_ADC           ON
              //          #if (POTI2_ADC > OFF)
              //              #define POTI2_ADC_ATT   ADC_ATTEN_DB_11
              //            #endif
              //          #define POTI2_1115            OFF
              //          #if (POTI2_1115 > OFF)
              //              #define POTI2_1115_UNIDX  0
              //              #define POTI2_1115_CHIDX 0
              //              #define POTI2_1115_ATT  GAIN_TWOTHIRDS
              //            #endif
              //          #if (USE_MQTT > OFF)
              //              #define MQTT_POTI2          "poti2"
              //            #endif
              //        #endif
              //      #ifndef USE_INPUT_CYCLE
              //          #define USE_INPUT_CYCLE
              //        #endif
            #endif
          #if (USE_ACS712_ANA > OFF)
              /*  ACS712 hall effect current sensor +/- 5A/20A/30 A
                  output: VCC/2 (2,5V) + measured value
                  sensitivity: type  5A -> 186mV/A ->  1570 - 3430 mV
                  sensitivity: type 20A -> 100mV/A ->   500 - 4500 mV
                  sensitivity: type 30A ->  66mV/A ->   520 - 4480 mV
                */
              #define I712_FILT               0
              #define I712_DROP               0
              #define I712_1_IMAX             5000 // mA
              #define I712_1_ADC              OFF // not recommended, low resolution
              #if (I712_1_ADC > OFF)
                  #define I712_1_ADC_ATT   ADC_ATTEN_DB_11
                #endif
              #define I712_1_1115             ON
              #if (I712_1_1115 > OFF)
                  #define I712_1_1115_UNIDX    0
                  #define I712_1_1115_CHIDX    1
                  #if   (I712_1_IMAX ==  5000)
                      #define ADS12_GAIN            GAIN_TWOTHIRDS
                      #define ADS12_RATE            RATE_ADS1115_128SPS
                      #define ADS12_MUX             ADS1X15_MUX_SINGLE
                      #define I712_1_SCAL_OFFRAW    0
                      #define I712_1_SCAL_GAIN      185
                      #define I712_1_SCAL_OFFREAL   0
                    #endif
                  #if (I712_1_IMAX == 20000)
                      #define ADS12_GAIN            GAIN_ONE
                      #define ADS12_RATE            RATE_ADS1115_128SPS
                      #define ADS12_MUX             ADS1X15_MUX_SINGLE
                      #define I712_1_SCAL_OFFRAW    0
                      #define I712_1_SCAL_GAIN      1
                      #define I712_1_SCAL_OFFRAW    0
                    #endif
                  #if (I712_1_IMAX == 30000)
                      #define ADS12_GAIN            GAIN_ONE
                      #define ADS12_RATE            RATE_ADS1115_128SPS
                      #define ADS12_MUX             ADS1X15_MUX_SINGLE
                      #define I712_1_SCAL_OFFRAW    0
                      #define I712_1_SCAL_GAIN      1
                      #define I712_1_SCAL_OFFRAW    0
                    #endif
                  #if (USE_MQTT > OFF)
                      #define MQTT_I712_1         "acs7121"
                    #endif
                #endif
              #if (USE_ACS712_ANA > 1)
                  #define I712_2_IMAX             5000 // mA
                  #define I712_2_ADC              OFF // not recommended, low resolution
                  #define I712_2_1115             ON
                  #if (I712_2_ADC > OFF)
                      #define I712_2_ADC_ATT   ADC_ATTEN_DB_11
                    #endif
                  #if (I712_2_1115 > OFF)
                      #define I712_2_1115_UNIDX     0
                      #define I712_2_1115_CHIDX    2
                      #if  (I712_2_IMAX ==  5000)
                          #define I712_2_1115_ATT       GAIN_ONE
                          #define I712_2_SCAL_OFFRAW    0
                          #define I712_2_SCAL_GAIN      1
                          #define I712_2_SCAL_OFFREAL   0
                        #endif
                      #if (I712_2_IMAX == 20000)
                          #define I712_2_1115_ATT      GAIN_TWOTHIRDS
                          #define I712_2_SCAL_OFFRAW    0
                          #define I712_2_SCAL_GAIN      1
                          #define I712_2_SCAL_OFFRAW    0
                        #endif
                      #if (I712_2_IMAX == 30000)
                          #define I712_2_1115_ATT      GAIN_TWOTHIRDS
                          #define I712_2_SCAL_OFFRAW    0
                          #define I712_2_SCAL_GAIN      1
                          #define I712_2_SCAL_OFFRAW    0
                        #endif
                      #if (USE_MQTT > OFF)
                          #define MQTT_I712_1         "acs7121"
                          #define MQTT_I712_2         "acs7122"
                        #endif
                    #endif
                #endif
            #endif
    // --- network
      // --- WIFI
          //#define UTC_SEASONTIME UTC_SUMMERTIME
        //#if (USE_WIFI > OFF)
        //    #define WIFI_ANZ_LOGIN  8
        //    #define WIFI_IS_DUTY    ON
        //    #define WIFI_SSID0      "M&M_mobil"   // Bauwagen
        //    #define WIFI_SSID0_PW   "M&M2KsR&N#"
        //    #define WIFI_SSID1      "MAMD-HomeG" // WLAN Moosgrabenstrasse 26
        //    #define WIFI_SSID1_PW   "ElaNanniRalf3"
        //    #define WIFI_SSID2      "HS-HomeG" // WLAN Am Jungberg 9
        //    #define WIFI_SSID2_PW   "ElaNanniRalf3"
        //    #define WIFI_SSID3      "WL-Fairnetz" //Weltladen
        //    #define WIFI_SSID3_PW   "WL&Fair2Live#"
        //    #define WIFI_SSID4      "MachNet" //machQuadrat
        //    #define WIFI_SSID4_PW   "!Machquadrat1"
        //    #define WIFI_SSID5      "MD_KingKong" //Hotspot Martin
        //    #define WIFI_SSID5_PW   "ElaNanniRalf3"
        //    #define WIFI_SSID6      "CDWiFi"        //OEBB Raijet
        //    #define WIFI_SSID6_PW   ""
        //    #define WIFI_SSID7      "xWIFI@DB"        //DB ICE
        //    #define WIFI_SSID7_PW   ""
        //    #define WIFI_SSID8      ""        //?
        //    #define WIFI_SSID8_PW   ""
        //    #define WIFI_SSID9      ""    // ?
        //    #define WIFI_SSID9_PW   ""
        //    #define WIFI_CONN_DELAY 500000ul // Scan-Abstand [us]
        //    #define WIFI_CONN_REP   5        // Anzahle der Connect-Schleifen
        //    #define WIFI_CONN_CYCLE 4000ul   // Intervallzeit fuer Recoonect [us]
        //    #define NTPSERVER_CYCLE 1000ul   // Intervallzeit [us]

