MDFreak/md_tinyhouse_ESP32/src/prj_conf_test_stdlib.h
        //    #define WIFI_ANZ_LOCIP  WIFI_ANZ_LOGIN
        //    //#define WIFI_FIXIP0           0x1800000Aul // 10.0.0.24   lowest first
        //    //#define WIFI_GATEWAY0         0x8B00000Aul // 10.0.0.139 // Moosgraben
        //    //#define WIFI_FIXIP1           0x1800000Aul // 10.0.0.24
        //    //#ifdef USE_LOCAL_IP
        //    #if (PIO_FIXIP >0)
        //        //#define USE_LOCAL_IP
        //        #define WIFI_FIXIP        0x01000000ul * PIO_FIXIP
        //        #define WIFI_GATEWAY0     0x0100000Aul // 10.0.0.1        // Bauwagen
        //        #define WIFI_FIXIP0       0x0000000Aul + WIFI_FIXIP
        //        #define WIFI_GATEWAY1     0x8B00000Aul // 10.0.0.139      // Moosgraben
        //        #define WIFI_FIXIP1       0x0000000Aul + WIFI_FIXIP
        //        #define WIFI_GATEWAY2     0x8B00000Aul // 10.0.0.139      // Jungberg
        //        #define WIFI_FIXIP2       0x0000000Aul + WIFI_FIXIP
        //        #define WIFI_GATEWAY3     0x8A00000Aul // 10.0.0.138      // Weltladen
        //        #define WIFI_FIXIP3       0x1600000Aul // 10.0.0.22
        //        #define WIFI_GATEWAY4     0x01250D0Aul // 10.0.0.1        // machquadrat
        //        #define WIFI_FIXIP4       0x6F250D0Aul // 10.0.0.22
        //        #define WIFI_GATEWAY5     0x012BA8C0ul // 192.168.43.154  // hotspot KingKong
        //        #define WIFI_FIXIP5       0x002BA8C0ul + WIFI_FIXIP
        //        #define WIFI_GATEWAY6     0x0926A8C0ul // 192.168.32.1    // OEBB Railjet
        //        #define WIFI_FIXIP6       0x1620A8C0ul // 192.168.32.22
        //        #define WIFI_GATEWAY7     0x01AE12ACul // 172.18.0.1    // DB ICE
        //        #define WIFI_FIXIP7       0x16AE12ACul // 172.18.174.22
        //        #define WIFI_GATEWAY8     0x0100000Aul // 10.0.0.10       // ?
        //        #define WIFI_FIXIP8       0x1600000Aul // 10.0.0.22  // ?
        //        #define WIFI_GATEWAY9     0x0100000Aul // 10.0.0.1        // ?
        //        #define WIFI_FIXIP9       0x1600000Aul // 10.0.0.22  // ?
        //        #define WIFI_SUBNET       0x0000FFFFul // 255.255.255.0
        //      #endif
        //  #endif
      // --- webserver
            //#if (USE_WEBSERVER > OFF)
            //    #define WEBSERVER_CYCLE       1000ul  // Intervallzeit [us]
            //  #endif
      // --- MQTT Mosquitto client
            //#if (USE_MQTT > OFF)
            //    #define MQTT_HOST             "10.0.0.203"
            //    #define MQTT_PORT             1883
            //    #define MQTT_SECURE           OFF
            //    #define MQTT_DEVICE           "esp-24"
            //    #define MQTT_TOPDEV           "esp-24/"
            //    #define MQTT_TOPIC_MAXLEN     20
            //    #define MQTT_PAYLOAD_MAXLEN   20
            //    #define MQTT_MSG_MAXANZ       10
            //    typedef struct MQTT_MSG
            //      {
            //        char  topic[MQTT_TOPIC_MAXLEN];
            //        char  payload[MQTT_PAYLOAD_MAXLEN];
            //        void* pNext;
            //      } MQTTmsg_t;
            //    #if(MQTT_SECURE > OFF)
            //        #define MQTT_BROKER_USER  "<user>"
            //        #define MQTT_BROKER_PASS  "<pass>"
            //      #endif
            //  #endif
    // --- user output
                // --- acoustic output
                  //  #if (USE_AOUT > OFF)
                    //      #if !(BUZZER1 ^ AOUT_PAS_BUZZ_3V5V)
                    //          #define PLAY_MUSIC
                    //          #define MUSIC_BASE_OCTA 5        // base oktave for musik
                    //          //#define PLAY_START_MUSIC
                    //          #define PLAY_START_DINGDONG
                    //        #endif
                    //    #endif // USE_BUZZER_PWM
                // WS2812 LEDs
                  //  #if (USE_WS2812_MATRIX_OUT > OFF)
                    //      #define COLCHAR_2812            6
                    //      #define COLBMP_2812             8
                    //      #define ROWBMP_2812             8
                    //      #define UPD_2812_M1_MS          70
                    //      #define COL24_2812_M1           0xFF0080u   // color r-g-b (5-6-5) = 255,0,128
                    //      #define COL24_2812_BM1          0xF0B63Cu   // color r-g-b (5-6-5) = 240, 182, 56
                    //      #define BRI_2812_M1             255
                    //      #define BRI_2812_BM1            255
                    //      #define ROW1_2812_M1            NEO_MATRIX_TOP
                    //      #define COL1_2812_M1            NEO_MATRIX_LEFT
                    //      #define DIR_2812_M1             NEO_MATRIX_COLUMNS
                    //      #define ORI_2812_M1             NEO_MATRIX_ZIGZAG
                    //      #define TYPE_2812_M1            WS2812B
                    //      #define COLORD_2812_M1          NEO_GRB
                    //      #define ROWPIX_2812_M1          8
                    //      #define LEDS_2812_M1            COLPIX_2812_M1 * ROWPIX_2812_M1
                    //      #define ROW1_2812_T1            NEO_MATRIX_TOP
                    //      #define COL1_2812_T1            NEO_MATRIX_LEFT
                    //      #define DIR_2812_T1             NEO_MATRIX_COLUMNS
                    //      #define ORI_2812_T1             NEO_MATRIX_ZIGZAG
                    //      #define COLPIX_2812_T1          8
                    //      #define ROWPIX_2812_T1          8
                    //      #define COLTIL_2812_M1          16  // needs correct value
                    //      #define ROWTIL_2812_M1          1   // 0 = OFF
                    //      #define ANZ_TILES_M1            COLTIL_2812_M1 * ROWPIX_2812_T1
                    //      #define COLPIX_2812_M1          COLTIL_2812_M1 * COLPIX_2812_T1
                    //      #define OFFBEG_2812_M1          1 //+ COLPIX_2812_T1
                    //      #define OFFEND_2812_M1          0 //+ COLPIX_2812_T1
                    //      #if (USE_WS2812_MATRIX_OUT > 1)
                      //          #define UPD_2812_M2_MS      8
                      //          #define LEDS_2812_M2        512
                      //          #define BRIGHT_2812_M2      5
                      //          #define TYPE_2812_M2        WS2812B
                      //          #define COLORD_2812_M2      NEO_GRB
                      //          #define COLPIX_2812_M2      128
                      //          #define ROWPIX_2812_M2      8
                      //          #define COLPIX_2812_T2      8
                      //          #define ROWPIX_2812_T2      8
                      //          #define COLTIL_2812_M2      4
                      //          #define ROWTIL_2812_M2      1
                      //        #endif
                    //      #if (USE_MQTT > OFF)
                      //          #define MQTT_MAX_BRIGHT   "max-bright"
                      //          #define MQTT_MAX_COLPICK  "max-colpick"
                      //        #endif
                    //      #ifndef USE_OUTPUT_CYCLE
                      //          #define USE_OUTPUT_CYCLE
                      //        #endif
                    //    #endif
                  //  #if (USE_WS2812_LINE_OUT > OFF)
                    //      #ifndef USE_OUTPUT_CYCLE
                    //          #define USE_OUTPUT_CYCLE
                    //        #endif
                    //      #define UPD_2812_L1_MS          10
                    //      #define COL24_2812_L1           0x6300F1u   // color r-g-b (5-6-5)
                    //      #define BRI_2812_L1             5u
                    //      #define TYPE_2812_L1            WS2812B
                    //      #define COLORD_2812_L1          NEO_GRB
                    //      #define COLPIX_2812_L1          30
                    //      #define ROWPIX_2812_L1          1
                    //      #define COLTIL_2812_L1          4
                    //      #define ROWTIL_2812_L1          1
                      //        //#define COLPIX_2812_T1 8
                      //        //#define ROWPIX_2812_T1 8
                      //            //#define UPD_2812_L1_MS 1
                      //            //#define LEDS_2812_L1   300
                      //            //#define BRIGHT_2812_L1 5
                      //            //#define TYPE_2812_L1   WS2812B
                      //            //#define COLORD_2812_L1 NEO_GRB
                    //      #if (USE_WS2812_LINE_OUT > 1)
                      //          #define UPD_2812_L2_MS      10
                      //          #define LEDS_2812_L2        30
                      //          #define BRIGHT_2812_L2      12
                      //          #define TYPE_2812_L2        WS2812B
                      //          #define COLORD_2812_L2      GRB
                      //          #if (USE_WS2812_LINE_OUT > 2)
                      //              #define LEDS_2812_L3    30
                      //              #define BRIGHT_2812_L3  12
                      //              #define TYPE_2812_L3    WS2812
                      //              #define COLORD_2812_L3  GRB
                      //              #if (USE_WS2812_LINE_OUT > 3)
                      //                  #define LEDS_2812_L4   30
                      //                  #define BRIGHT_2812_L4 12
                      //                  #define TYPE_2812_L4   WS2812
                      //                  #define COLORD_2812_L4 GRB
                      //                #endif
                      //            #endif
                      //        #endif
                    //      #if (USE_MQTT > OFF)
                      //          #define MQTT_LIN_BRIGHT     "lin-bright"
                      //          #define MQTT_LIN_COLPICK    "lin-colpick"
                      //        #endif
                    //    #endif
                    //// --- digital out
                  //  #if (USE_GEN_DIG_OUT > OFF)
                    //      #define DIG_OUT1_INV            ON   // Online controlled output
                    //      #if (USE_MQTT > OFF)
                    //          #define MQTT_TEST_LED       "test-led"
                    //        #endif
                    //    #endif
                    //// --- PWM
                  //  #if (USE_RGBLED_PWM > OFF)
                    //      #ifndef USE_OUTPUT_CYCLE
                    //          #define USE_OUTPUT_CYCLE
                    //        #endif
                    //      #define PWM_LEDS_CYCLE_MS       600u
                    //      #define PWM_LEDS_FREQ           4000u
                    //      #define PWM_LEDS_RES            8
                    //      #define BRI_RGBLED_1            15
                    //      #define COL24_RGBLED_1          0xBE2727u   // bright 10 + red 10 + green 10 + blue 10
                    //      #if (USE_MQTT > OFF)
                    //          #define MQTT_RGB_BRIGHT     "rgb-bright"
                    //          #define MQTT_RGB_COLPICK    "rgb-colpick"
                    //        #endif
                    //      #endif
                  //  #if (USE_FAN_PWM > OFF)
                    //      #ifndef USE_OUTPUT_CYCLE
                    //          #define USE_OUTPUT_CYCLE
                    //        #endif
                    //      #define PWM_FAN_CYCLE_MS        390u
                    //      #define PWM_FAN_FREQ            4500u
                    //      #define PWM_FAN_RES             8
                    //      #if (USE_MQTT > OFF)
                    //          #define MQTT_FAN1           "fan1"
                    //          #define MQTT_FAN2           "fan2"
                    //        #endif
                    //    #endif
                    //// --- user input
                      //// --- keypads
                  //  #if defined(KEYS)
                    //      #ifndef USE_INPUT_CYCLE
                    //          #define USE_INPUT_CYCLE
                    //        #endif
                    //      #if !(KEYS ^ MC_UI_Keypad_ANA0_RO)
                    //          #define USE_KEYPADSHIELD
                    //          #define KEYS_ADC            34   // ADC Pin GPIO02
                    //          #define ADC_STD_RES         12   // default resolution 12 Bit
                    //          #define ADC_RES             12   // active resolution
                    //          #define KP_NUM_KEYS         5
                    //          #define KP_KEY_VAL_1        200  // max ADC value of button 0
                    //          #define KP_KEY_VAL_2        750
                    //          #define KP_KEY_VAL_3        1470
                    //          #define KP_KEY_VAL_4        2330
                    //          #define KP_KEY_VAL_5        3200
                    //        #endif // keypad
                    //      #if !(KEYS ^ MC_UI_TOUCHXPT2046_AZ)
                    //          // Keypad start position, key sizes and spacing
                    //          #define KEY_X               40 // Centre of key
                    //          #define KEY_Y               287
                    //          #define KEY_W               62 // Width and height
                    //          #define KEY_H               26
                    //          #define KEY_SPACING_X       18 // X and Y gap
                    //          #define KEY_SPACING_Y       20
                    //          #define KEY_TEXTSIZE        1   // Font size multiplier
                    //          #define KEY_NUM_LEN         3 // Anzahl der Tasten
                    //        #endif // touchpad
                    //    #endif
                    //// --- counter
                  //  #if (USE_CNT_INP > OFF)
                    //      #define PCNT_H_LIM_VAL      0   // not used
                    //      #define PCNT_L_LIM_VAL      0   // not used
                    //      #define PNCT_AUTO_SWDN      5000000ul  // > 5 sec period
                    //      #define PNCT_AUTO_SWUP      50000ul    // < 50 msec period
                    //      // counter 1
                    //      #define PCNT1_INP_FILT      10  // glitch filter (clock 80 MHz)
                    //      #define PCNT1_UFLOW         3000000ul  // timedelay due to 0 Hz [us]
                    //      //#define PCNT1_INP_SIG_IO    PIN_CNT_FAN_1       // Pulse Input GPIO
                    //      //#define PCNT1_INP_CTRL_IO   PIN_CNT_FAN_1       // Control GPIO HIGH=count up, LOW=count down
                    //      //#define PCNT1_THRESH1_VAL   5
                    //      #define PCNT1_THRESH0_VAL   3
                    //      #define PCNT1_EVT_0         PCNT_EVT_THRES_0
                    //      //#define PCNT1_EVT_1         PCNT_EVT_THRES_1
                    //      #define PCNT1_UNIDX          0
                    //      #define PCNT1_CHIDX          0
                    //      #define PCNT1_ID            0
                  //      #if (USE_CNT_INP > 1)
                    //          // counter 2
                    //          #define PCNT2_INP_FILT      10  // glitch filter (clock 80 MHz)
                    //          #define PCNT2_UFLOW         3000000ul  // timedelay due to 0 Hz [us]
                    //          //#define PCNT2_INP_SIG_IO    PIN_CNT_FAN_2   // Pulse Input GPIO
                    //          //#define PCNT2_INP_CTRL_IO   PIN_CNT_FAN_2       // Control GPIO HIGH=count up, LOW=count down
                    //          //#define PCNT2_THRESH1_VAL   2
                    //          #define PCNT2_THRESH0_VAL   400
                    //          #define PCNT2_EVT_0         PCNT_EVT_THRES_0
                    //          #define PCNT2_UNIDX          1
                    //          #define PCNT2_CHIDX          0
                    //          #define PCNT2_ID            1
                    //        #endif
                    //      #ifndef USE_INPUT_CYCLE
                    //          #define USE_INPUT_CYCLE
                    //        #endif
                    //    #endif
                    //// --- dutycycle (pwm) input
                    //  #if (USE_PWM_INP > OFF)
                    //    #endif
                    //// --- internal adc input
                    //  #if (USE_ADC1 > OFF)
                    //      #ifndef USE_INPUT_CYCLE
                    //          #define USE_INPUT_CYCLE
                    //        #endif
                    //    #endif
                    //// --- internal digital input
                    //  #if (USE_DIG_INP > OFF)
                    //      #ifndef USE_INPUT_CYCLE
                    //          #define USE_INPUT_CYCLE
                    //        #endif
                    //      #if (USE_CTRL_SW_INP > OFF)
                    //          #define INP_SW_CTRL         0
                    //          #define POL_SW_CTRL         HIGH // LOW, HIGH
                    //          #define MOD_SW_CTRL         INPUT_PULLUP // INPUT, INPUT_PULLDOWN
                    //        #endif
                    //      #if (USE_GEN_SW_INP > OFF)
                    //          #define INP_REED_1          0
                    //          #define POL_REED_1          LOW // LOW, HIGH
                    //          #define MOD_REED_1          INPUT_PULLUP // INPUT, INPUT_PULLDOWN
                    //        #endif
                    //    #endif
                // --- memories
                  //// ---
                  //  #define FORMAT_SPIFFS_IF_FAILED true
                // --- FRAM
                  //  #if (USE_FRAM_I2C > OFF)
                  //      #define SIZE_FRAM               0x8000
                  //    #endif
                // --- sensors
                  //#if (USE_DS18B20_1W_IO > OFF)
                  //    #define DS_T_PRECISION            9
                  //    #define DS18B20_FILT              0
                  //    #define DS18B20_Drop              0
                  //    #if (USE_MQTT > OFF)
                  //        #define MQTT_DS18B201         "ds18b201"
                  //        #define MQTT_DS18B202         "ds18b202"
                  //      #endif
                  //    #ifndef USE_INPUT_CYCLE
                  //        #define USE_INPUT_CYCLE
                  //      #endif
                  //  #endif
      //
      // --- cycle timing
        #define DISP_CYCLE_MS       100ul   // Intervallzeit [us]
        // output status line
        #define STAT_DELTIME_MS     5000ul  // default time to clear status
        #define STAT_NEWTIME_MS     1000ul  // default time to clear status
        #ifdef USE_INPUT_CYCLE
            #define INPUT_CYCLE_MS  10u
          #endif // USE_INPUT_CYCLE
        #ifdef USE_OUTPUT_CYCLE
            #define OUTPUT_CYCLE_MS 20u
          #endif // USE_OUTPUT_CYCLE
  // ----------------------------------------------------------------
  // --- board management
  // ----------------------------------------------------------------
    #if (PRJ_BOARD == MC_ESP32_NODE)
      // --- system pins, connections
        // --- user input
              //#if (USE_CTRL_POTI > OFF)
              //    #define PIN_INP_POTI_1      35   // ADC 1-5
              //    #define ADC_INP_POTI_1      NU   // ADC 1-5
              //  #endif
              //#if (USE_CTRL_SW_INP > OFF)
              //    #define PIN_INP_SW_1        32   // INPUT_PULLUP
              //  #endif
              //#if (USE_DIG_INP > OFF)
              //    #if (USE_GEN_SW_INP > OFF)
              //        #define PIN_INP_REED_1  15
              //      #endif
              //  #endif
              //#if (USE_GEN_CNT_INP > OFF)
              //    #define PIN_CNT_GEN_S0      4
              //    #define PIN_CNT_GEN_C0      PCNT_PIN_NOT_USED
              //    #define PIN_CNT_GEN_S1      17
              //    #define PIN_CNT_GEN_C1      PCNT_PIN_NOT_USED
              //  #endif
              //#if (USE_PWM_INP > OFF)
              //      #define PIN_PWM_INP_1     PIN_CNT_GEN_2
              //  #endif
        // --- counter
              //#if (USE_CNT_INP > OFF)
              //    #define PCNT1_INP_SIG_IO    PIN_CNT_FAN_1       // Pulse Input GPIO
              //    #define PCNT1_INP_CTRL_IO   PIN_CNT_FAN_1       // Control GPIO HIGH=count up, LOW=count down
              //    #if (USE_CNT_INP > 1)
              //        // counter 2
              //        #define PCNT2_INP_SIG_IO    PIN_CNT_FAN_2   // Pulse Input GPIO
              //        #define PCNT2_INP_CTRL_IO   PIN_CNT_FAN_2       // Control GPIO HIGH=count up, LOW=count down
              //      #endif
              //    #ifndef USE_INPUT_CYCLE
              //        #define USE_INPUT_CYCLE
              //      #endif
              //  #endif
        // --- user output
              //#if (USE_GEN_DIG_OUT > OFF)
              //    #define PIN_GEN_DIG_OUT1     15   // Online controlled output
              //  #endif
              //#if (USE_TRAFFIC_LED_OUT > OFF)
              //    #define PIN_TL_RED          26   // RGB red
              //    #define PIN_TL_YELLOW       25   // RGB green
              //    #define PIN_TL_GREEN        33   // RGB blue
              //  #endif
              //#if (USE_RGBLED_PWM > OFF)
              //    #define PIN_RGB_RED         33 //26   // RGB red
              //    #define PIN_RGB_GREEN       26   // RGB blue
              //    #define PIN_RGB_BLUE        14 //33   // RGB blue
              //  #endif
              //#if (USE_FAN_PWM > OFF)
              //    #define PIN_PWM_FAN_1       0
              //    #if (USE_FAN_PWM > 1)
              //        #define PIN_PWM_FAN_2   4
              //      #endif
              //  #endif
              //#if (USE_OUT_FREQ_PWM > OFF)
              //    #define PIN_FREQ_1          26
              //  #endif
              //#if (USE_WS2812_MATRIX_OUT > OFF)
              //    #define PIN_WS2812_M1      16
              //    #if (USE_WS2812_PWR_IN_SW > OFF)
              //        #define PIN_WS2812_PWR_IN_SW 36
              //      #endif
              //    #if (USE_WS2812_MATRIX_OUT > 1)
              //        #define PIN_WS2812_M2   32
              //      #endif
              //      //#define PIN_WS2812_M3  x
              //      //#define PIN_WS2812_M4  x
              //  #endif
              //#if (USE_WS2812_LINE_OUT > OFF)
              //    #if (USE_WS2812_PWR_IN_SW > OFF)
              //        #define PIN_WS2812_PWR_IN_SW 36
              //      #endif
              //    #define PIN_WS2812_L1      12
              //      //#define PIN_WS2812_L2    17
              //      //#define PIN_WS2812_L3  x
              //      //#define PIN_WS2812_L4  x
              //  #endif
              //#if (USE_DISP_TFT > OFF)
              //    #if !(DISP_TFT ^ MC_UO_TFT1602_GPIO_RO)
              //        #define LCD_BL      5    // D10/SS  ARDUINO
              //        #define LCD_EN      13   // D9
              //        #define LCD_RS      12   // D8
              //        #define LCD_D7      14   // D7
              //        #define LCD_D6      27   // D6
              //        #define LCD_D5      16   // D5
              //        #define LCD_D4      17   // D4
              //      #endif
              //    #if !(DISP_TFT ^ MC_UO_TOUCHXPT2046_AZ)
              //        #define TFT_CS      5
              //        #define TFT_DC      4
              //        #define TFT_RST     22
              //        #define TFT_LED     15
              //        #define TOUCH_CS    14
              //        #define TOUCH_IRQ   27
              //        #define LED_ON      0
              //      #endif
              //    #if !(DISP_TFT ^ MC_UO_TFT1602_I2C_XA)
              //        #define ME
              //      #endif
