MDFreak/md_tinyhouse_ESP32/src/prj_conf_test_stdlib.h
              //  #endif
              //#if (USE_BUZZER_PWM > OFF)
              //    #define PIN_BUZZ      32
              //  #endif
        // --- sensors
              //#if (USE_DS18B20_1W_IO > OFF)
              //    #define DS1_ONEWIRE_PIN     27
              //    #if (USE_DS18B20_1W_IO > 1)
              //        #define DS2_ONEWIRE_PIN 32
              //      #endif
              //  #endif
              //#if (USE_MQ135_GAS_ANA > OFF)
              //    #define PIN_MQ135           35
              //    #define ADC_MQ135           5   // ADC 1-3
              //  #endif
              //#if (USE_MQ3_ALK_ANA > OFF)
              //    #if (MQ3_ALK_ADC > OFF)
              //        #define PIN_MQ135           35
              //        #define ADC_MQ135           5   // ADC 1-3
              //      #endif
              //  #endif
              //#if (USE_PHOTO_SENS_ANA > OFF)
              //    #define PIN_PHOTO1_SENS     39
              //    #define ADC_PHOTO1_SENS     3
              //  #endif
        // --- memory
              //#if (USE_FRAM_I2C > OFF)
              //    #define FRAM1_I2C_SCL       PIN_I2C1_SCL
              //    #define FRAM1_I2C_SDA       PIN_I2C1_SDA
              //    #if (USE_FRAM_I2C > 1 )
              //        #define FRAM2_I2C_SCL   I2C1_SCL
              //        #define FRAM2_I2C_SDA   I2C1_SDA
              //      #endif
              //  #endif
              //#if (USE_SD_SPI > OFF)
              //    #define SD_SPI              VSPI
              //    #define SD_MISO             PIN_SPI_MISO
              //    #define SD_MOSI             PIN_SPI_MOSI
              //    #define SD_SCL              PIN_SPI_SCL
              //    #define SD_CS               5
              //  #endif
        // --- PWM channels   0..15
              //#if (USE_PWM_OUT > OFF)
              //    #if (USE_AOUT > OFF)
              //        #if (USE_BUZZER_PWM > OFF)
              //            #define PWM_BUZZ  0
              //          #endif
              //      #endif
              //    #if (USE_TRAFFIC_LED_OUT > OFF)
              //        #define PWM_TL_GREEN  1
              //        #define PWM_TL_YELLOW 2
              //        #define PWM_TL_RED    3
              //      #endif
              //    #if (USE_RGBLED_PWM > OFF)
              //        #define PWM_RGB_RED     1
              //        #define PWM_RGB_GREEN   2
              //        #define PWM_RGB_BLUE    3
              //      #endif
              //    #if (USE_FAN_PWM > OFF)
              //        #define PWM_FAN_1       4
              //        #if (USE_FAN_PWM > 1)
              //            #define PWM_FAN_2   0
              //          #endif
              //      #endif
              //    #if (USE_OUT_FREQ_PWM > OFF)
              //        #define PWM_FREQ_1      6
              //      #endif
              //  #endif
        // --- counter channels  0..7
              //#if (USE_CNT_INP > OFF)
              //    #define USE_CNT_UNIDX       PCNT_UNIDX_0
              //    #if (USE_GEN_CNT_INP > OFF)
              //        #define CNT_UNIDX_GEN0  PCNT_UNIDX_0
              //        #define CNT_CH_GEN0    (PCNT_CHANNEL_0)
              //        #undef  USE_CNT_UNIDX
              //        #define USE_CNT_UNIDX   (CNT_UNIDX_GEN0 + 1)
              //      #endif
              //    #if (USE_GEN_CNT_INP > 1)
              //        #define CNT_UNIDX_GEN1  PCNT_UNIDX_1
              //        #define CNT_CH_GEN1    (PCNT_CHANNEL_0)
              //        #undef  USE_CNT_UNIDX
              //        #define USE_CNT_UNIDX   (CNT_UNIDX_GEN1 + 1)
              //      #endif
              //    #if (USE_GEN_CNT_INP > 2)
              //        #define CNT_UNIDX_GEN2  PCNT_UNIDX_2
              //        #define CNT_CH_GEN2    (PCNT_CHANNEL_0)
              //        #undef  USE_CNT_UNIDX
              //        #define USE_CNT_UNIDX   (CNT_UNIDX_GEN2 + 1)
              //      #endif
              //    #if (USE_GEN_CNT_INP > 3)
              //        #define CNT_UNIDX_GEN3  PCNT_UNIDX_3
              //        #define CNT_CH_GEN3    (PCNT_CHANNEL_0)
              //        #undef  USE_CNT_UNIDX
              //        #define USE_CNT_UNIDX   (CNT_UNIDX_GEN3 + 1)
              //      #endif
              //  #endif
      #endif // PRJ_BOARD
    // ******************************************
#endif // _PRJ_CONF_TEST_STDLIB_H_
